In [1]:
import pandas as pd

In [4]:
data = pd.read_csv('income-adult.data',header=None)

In [5]:
data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [6]:
data.columns = ['age','workclass','fnlwgt', 'education', 'education-num', 'marital-status', 'occupation', 'relationship', 'race','sex' ,'capital-gain', 'capital-loss', 'hours-per-week', 'native-country', 'salary']

In [7]:
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [8]:
from sklearn.preprocessing import LabelEncoder 
le=LabelEncoder()

In [12]:
cat_cols = ['workclass', 'education', 'marital-status', 'occupation', 'relationship', 'race', 'sex','native-country', 'salary' ]

for col in cat_cols:
    data[col] = le.fit_transform(data[col])

In [13]:
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,7,77516,9,13,4,1,1,4,1,2174,0,40,39,0
1,50,6,83311,9,13,2,4,0,4,1,0,0,13,39,0
2,38,4,215646,11,9,0,6,1,4,1,0,0,40,39,0
3,53,4,234721,1,7,2,6,0,2,1,0,0,40,39,0
4,28,4,338409,9,13,2,10,5,2,0,0,0,40,5,0

In [14]:
from sklearn import linear_model

In [15]:
lg = linear_model.LogisticRegression()

In [18]:
from sklearn.model_selection import train_test_split
X1,X2,y1,y2 = train_test_split(data.iloc[:,:-1], data.iloc[:,-1], random_state=0, train_size=0.7)

C:\Users\ZekeLabs\Anaconda3-N\lib\site-packages\sklearn\model_selection\_split.py:2010: FutureWarning: From version 0.21, test_size will always complement train_size unless both are specified.
  FutureWarning)

In [19]:
X1.shape

(22792, 14)

In [20]:
X2.shape

(9769, 14)

In [21]:
X1.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country
32098,45,4,170871,11,9,2,3,0,4,1,7298,0,60,39
25206,47,7,108890,11,9,0,1,4,4,0,1831,0,38,39
23491,48,4,187505,15,10,2,12,0,4,1,0,0,50,39
12367,29,4,145592,11,9,4,3,1,4,1,0,0,40,13
7054,23,4,203003,5,4,4,3,1,4,1,0,0,25,11

In [22]:
lg.fit(X1,y1)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [23]:
y_pred = lg.predict(X2)

In [24]:
from sklearn.metrics import accuracy_score

In [25]:
accuracy_score(y2,y_pred)

0.79670385914627906

In [28]:
data.iloc[0][:-1]

age                  39
workclass             7
fnlwgt            77516
education             9
education-num        13
marital-status        4
occupation            1
relationship          1
race                  4
sex                   1
capital-gain       2174
capital-loss          0
hours-per-week       40
native-country       39
Name: 0, dtype: int64

In [30]:
lg.predict([data.iloc[0][:-1]])

array([0], dtype=int64)

In [33]:
new_data = pd.read_csv('incme-adult.test.txt',header=None)

In [34]:
new_data.columns = ['age','workclass','fnlwgt', 'education', 'education-num', 'marital-status', 'occupation', 'relationship', 'race','sex' ,'capital-gain', 'capital-loss', 'hours-per-week', 'native-country', 'salary']

In [49]:
cat_cols = ['workclass', 'education', 'marital-status', 'occupation', 'relationship', 'race', 'sex','native-country', 'salary' ]

for col in cat_cols:
    new_data[col] = le.fit_transform(new_data[col])

In [50]:
new_data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,25,4,226802,1,7,4,7,3,2,1,0,0,40,38,0
1,38,4,89814,11,9,2,5,0,4,1,0,0,50,38,0
2,28,2,336951,7,12,2,11,0,4,1,0,0,40,38,1
3,44,4,160323,15,10,2,7,0,2,1,7688,0,40,38,1
4,18,0,103497,15,10,4,0,3,4,0,0,0,30,38,0

In [47]:
lg.predict([new_data.iloc[2,:-1]])

array([0], dtype=int64)

In [51]:
y_new_pred = lg.predict(new_data.iloc[:,:-1])

In [52]:
accuracy_score(new_data.iloc[:,-1], y_new_pred)

0.7957127940544193

In [53]:
lg.classes_

array([0, 1], dtype=int64)

In [54]:
lg.get_params

<bound method BaseEstimator.get_params of LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)>